* Isunnguata_46km-11B
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Isunnguata_46km-11B
Place name                       | Isunnguata Sermia
Geographic location              | Central West Greenland
Ice type                         | Ice sheet
Data Source                      | Meierbachtol email
Data DOI                         | 
Science Source                   | Harrington, Joel A., Humphrey, Neil F., Harper, Joel T.: Temperature distribution and thermal anomalies along a flowline of the Greenland ice sheet , Annals of Glaciology 56(70), 98–104, 2015 
Science DOI                      | 10.3189/2015AoG70A949
Date                             | 2011
Longitude [°E]                   | -49.2891
Latitude [°N]                    | 67.20134
Location Source                  | T. Meierbachtol email
Depth of top measurement [m]     | 114.0
Depth of bottom measurement [m]  | 728
Ice thickness [m]                | 815
Coverage [% of thickness]        | 75
Ice thickness source             | T. Meierbachtol email
Note                             | See data in M1-10 folder; Harrington 2015 name: S5-B
#+end_example

** Temperature

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|     d |          t |
| 114.5 | -11.224577 |
| 134.5 |   -11.7155 |
| 154.5 | -11.783346 |
| 174.5 | -11.858885 |
| 194.5 | -12.142115 |
| 214.5 | -12.725346 |
| 234.5 |   -13.0855 |
| 254.5 | -13.391808 |
| 274.5 | -13.805808 |
| 294.5 | -13.758269 |
| 314.5 | -13.595346 |
| 334.5 | -13.747808 |
| 354.5 | -13.492577 |
| 374.5 | -13.591192 |
| 394.5 | -13.451346 |
| 414.5 | -13.326885 |
| 434.5 | -13.371654 |
| 454.5 | -13.047192 |
| 474.5 | -12.768885 |
| 494.5 | -12.782885 |
| 514.5 |   -12.4815 |
| 534.5 | -12.057038 |
| 554.5 | -11.471038 |
| 574.5 |   -10.7235 |
| 594.5 | -10.145192 |
| 614.5 | -9.2053462 |
| 634.5 | -8.2578077 |
| 654.5 | -7.2718077 |
| 674.5 | -6.3011923 |
| 694.5 | -5.1382692 |
| 714.5 | -4.1907308 |
| 734.5 |    -3.1355 |

